devdnl/dnx-rtos/src/system/drivers/usbd/stm32f1/usbd.c
/*=========================================================================*//**
@file    usbd.c

@author  Daniel Zorychta

@brief   USB-Device module.

@note    Copyright (C) 2014  Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "core/module.h"
#include "stm32f1/stm32f10x.h"
#include "usbd_cfg.h"
#include "usbd_def.h"
#include "usbd_ioctl.h"
#include "stm32f1/gpio_cfg.h"

/*==============================================================================
  Local macros
==============================================================================*/
#define BTABLE_ADDRESS          0
#define BTABLE_SIZE             32      /* number of uin16_t words */
#define PMA_SIZE                256     /* number of uin16_t words */
#define USB_PMA                 ((usb_pma_t*)((uint32_t)USB_PMA_BASE + BTABLE_ADDRESS))
#define NUMBER_OF_ENDPOINTS     _USBD_NUMBER_OF_ENDPOINTS

#define USB_EPR_EA              USB_EP0R_EA
#define USB_EPR_STAT_TX         USB_EP0R_STAT_TX
#define USB_EPR_STAT_TX_0       USB_EP0R_STAT_TX_0
#define USB_EPR_STAT_TX_1       USB_EP0R_STAT_TX_1
#define USB_EPR_DTOG_TX         USB_EP0R_DTOG_TX
#define USB_EPR_CTR_TX          USB_EP0R_CTR_TX
#define USB_EPR_EP_KIND         USB_EP0R_EP_KIND
#define USB_EPR_EP_TYPE         USB_EP0R_EP_TYPE
#define USB_EPR_EP_TYPE_0       USB_EP0R_EP_TYPE_0
#define USB_EPR_EP_TYPE_1       USB_EP0R_EP_TYPE_1
#define USB_EPR_SETUP           USB_EP0R_SETUP
#define USB_EPR_STAT_RX         USB_EP0R_STAT_RX
#define USB_EPR_STAT_RX_0       USB_EP0R_STAT_RX_0
#define USB_EPR_STAT_RX_1       USB_EP0R_STAT_RX_1
#define USB_EPR_DTOG_RX         USB_EP0R_DTOG_RX
#define USB_EPR_CTR_RX          USB_EP0R_CTR_RX

/*==============================================================================
  Local object types
==============================================================================*/
/**
 * Endpoint statuses
 */
typedef enum {
        USB_EP_STATUS__DISABLED,
        USB_EP_STATUS__STALL,
        USB_EP_STATUS__NAK,
        USB_EP_STATUS__VALID
} usb_ep_status_t;

/**
 * PMA buffer definition
 */
typedef struct {
        union {
                struct {
                        u32_t ADDR_TX;
                        u32_t COUNT_TX;
                        u32_t ADDR_RX;
                        u32_t COUNT_RX;
                } SBF;

                struct {
                        u32_t ADDR_0;
                        u32_t COUNT_0;
                        u32_t ADDR_1;
                        u32_t COUNT_1;
                } DBF_RX;

                struct {
                        u32_t ADDR_0;
                        u32_t COUNT_0;
                        u32_t ADDR_1;
                        u32_t COUNT_1;
                } DBF_TX;
        } EP[NUMBER_OF_ENDPOINTS];

        u32_t BUFFER[PMA_SIZE - BTABLE_SIZE];
} usb_pma_t;

/**
 * single endpoint object
 */
typedef struct {
        sem_t                  *tx;                     /* interrupt/setup transfer completed semaphore */
        sem_t                  *rx;                     /* interrupt/setup transfer completed semaphore */
        sem_t                  *setup;                  /* setup transfer completed semaphore */
        dev_lock_t              dev_lock;               /* device lock object */
        volatile bool           setup_in_progress :1;   /* flag that indicate setup in progress */
        volatile bool           read_in_progress  :1;   /* flag that indicate read in progress */
        volatile bool           write_in_progress :1;   /* flag that indicate write in progress */
        u8_t                    minor;                  /* endpoint number */
} USB_ep_t;

/**
 * General module variables
 */
typedef struct {
        USB_ep_t               *ep[NUMBER_OF_ENDPOINTS];
        const usbd_ep_config_t *ep_config;
        u8_t                    major;
        bool                    activated;
        bool                    reset;
        int                     error_cnt;
} USB_mem_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static inline void enable_usb_visible_pullup    ();
static inline void disable_usb_visible_pullup   ();
static void        set_ep_tx_status             (usb_ep_num_t ep, usb_ep_status_t status);
static void        set_ep_rx_status             (usb_ep_num_t ep, usb_ep_status_t status);
static void        disable_endpoint             (usb_ep_num_t ep);
static u16_t       endpoint_size_to_register    (u16_t size);
static void        configure_endpoint_0         ();
static bool        configure_endpoints_1_7      ();
static void        low_level_pma_write          (u32_t pma_offset, const u8_t *buffer, size_t count);
static void        low_level_pma_read           (u32_t pma_offset, u8_t *buffer, size_t count);
static bool        send_ZLP                     (usb_ep_num_t ep);
static size_t      get_ep_tx_buf_size           (usb_ep_num_t ep);
static size_t      get_ep_rx_buf_size           (usb_ep_num_t ep);
static size_t      get_ep_received_size         (usb_ep_num_t ep);
static void        set_setup_in_progress        (usb_ep_num_t ep, bool state);
static void        set_write_in_progress        (usb_ep_num_t ep, bool state);
static void        set_read_in_progress         (usb_ep_num_t ep, bool state);

/*==============================================================================
  Local objects
==============================================================================*/
MODULE_NAME(USBD);

static USB_mem_t *usb_mem;

