devdnl/dnx-rtos/src/system/drivers/usbd/stm32f1/usbd.c
static const uint16_t ep_tx_status_reg[] = {
        [USB_EP_STATUS__DISABLED] = 0,
        [USB_EP_STATUS__STALL   ] = (USB_EP0R_STAT_TX_0),
        [USB_EP_STATUS__NAK     ] = (USB_EP0R_STAT_TX_1),
        [USB_EP_STATUS__VALID   ] = (USB_EP0R_STAT_TX_1 | USB_EP0R_STAT_TX_0)
};

static const uint16_t ep_rx_status_reg[] = {
        [USB_EP_STATUS__DISABLED] = 0,
        [USB_EP_STATUS__STALL   ] = (USB_EP0R_STAT_RX_0),
        [USB_EP_STATUS__NAK     ] = (USB_EP0R_STAT_RX_1),
        [USB_EP_STATUS__VALID   ] = (USB_EP0R_STAT_RX_1 | USB_EP0R_STAT_RX_0)
};

static const uint16_t transfer_type_reg[] = {
        [USB_TRANSFER__BULK       ] = 0,
        [USB_TRANSFER__CONTROL    ] = (USB_EP0R_EP_TYPE_0),
        [USB_TRANSFER__ISOCHRONOUS] = (USB_EP0R_EP_TYPE_1),
        [USB_TRANSFER__INTERRUPT  ] = (USB_EP0R_EP_TYPE_1 | USB_EP0R_EP_TYPE_0)
};

static const uint ep0_status_stage_timeout_ms          = 5;
static const uint ep0_data_stage_transmit_timeout_ms   = 2000;
static const uint ep0_data_stage_receive_timeout_ms    = MAX_DELAY_MS;
static const uint ep1_7_data_stage_transmit_timeout_ms = 4500;


/*==============================================================================
  Exported objects
==============================================================================*/

/*==============================================================================
  External objects
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_INIT(USBD, void **device_handle, u8_t major, u8_t minor)
{
        if (major == _USBD_MAJOR_NUMBER && minor <= _USBD_MINOR_NUMBER_EP_7) {

                /* allocate main USB memory */
                if (usb_mem == NULL) {
                        if (RCC->APB1ENR & RCC_APB1ENR_CAN1EN) {
                                errno = EADDRINUSE;
                                return STD_RET_ERROR;
                        }

                        USB_mem_t *hdl = calloc(1, sizeof(USB_mem_t));
                        if (hdl) {
                                /* enable USB clock */
                                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);
                                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);
                                SET_BIT(RCC->APB1ENR, RCC_APB1ENR_USBEN);

                                /* enable USB interrupts in NVIC */
                                NVIC_SetPriority(USB_LP_CAN1_RX0_IRQn, _USBD_IRQ_PRIORITY);
                                NVIC_EnableIRQ(USB_LP_CAN1_RX0_IRQn);

                                /* set allocated memory */
                                *device_handle = hdl;
                                usb_mem        = hdl;
                                hdl->activated = false;
                                hdl->major     = major;
                        }
                }

                /* allocate Endpoint memory */
                if (usb_mem != NULL) {
                        sem_t    *setup_sem = (minor == USB_EP_NUM__ENDP0 ? _sys_semaphore_new(1, 0) : NULL);
                        sem_t    *rx_sem    = _sys_semaphore_new(1, 0);
                        sem_t    *tx_sem    = _sys_semaphore_new(1, 0);
                        USB_ep_t *ep_hdl    = calloc(1, sizeof(USB_ep_t));

                        if (ep_hdl && tx_sem && rx_sem && (setup_sem || minor != USB_EP_NUM__ENDP0)) {

                                if (minor == USB_EP_NUM__ENDP0) {
                                        _sys_semaphore_wait(setup_sem, 0);
                                }

                                ep_hdl->minor        = minor;
                                ep_hdl->rx           = rx_sem;
                                ep_hdl->tx           = tx_sem;
                                ep_hdl->setup        = setup_sem;
                                usb_mem->ep[minor]   = ep_hdl;
                                *device_handle       = ep_hdl;

                                return STD_RET_OK;
                        } else {
                                if (rx_sem) {
                                        _sys_semaphore_delete(rx_sem);
                                }

                                if (tx_sem) {
                                        _sys_semaphore_delete(tx_sem);
                                }

                                if (setup_sem) {
                                        _sys_semaphore_delete(setup_sem);
                                }

                                if (ep_hdl) {
                                        free(ep_hdl);
                                }
                        }
                }
        }

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_RELEASE(USBD, void *device_handle)
{
        if (usb_mem->activated == false) {
                USB_ep_t *ep_hdl = device_handle;

                disable_endpoint(ep_hdl->minor);

                _sys_semaphore_delete(ep_hdl->rx);
                ep_hdl->rx = NULL;

                _sys_semaphore_delete(ep_hdl->tx);
                ep_hdl->tx = NULL;

                if (ep_hdl->setup) {
                        _sys_semaphore_delete(ep_hdl->setup);
                        ep_hdl->setup = NULL;
                }

                usb_mem->ep[ep_hdl->minor] = NULL;
                free(ep_hdl);

                /* find if all endpoints are disabled */
                for (int i = _USBD_MINOR_NUMBER_EP_0; i <= _USBD_MINOR_NUMBER_EP_7; i++) {
                        if (usb_mem->ep[i] != NULL) {
                                return STD_RET_OK;
                        }
                }

                /* deinitializes enitre module because all endpoints are disabled */
                /* disable USB IRQs */
                NVIC_DisableIRQ(USB_LP_CAN1_RX0_IRQn);

