devdnl/dnx-rtos/src/system/drivers/usbd/stm32f1/usbd.c
                /* disable USB clock */
                SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);
                CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);
                CLEAR_BIT(RCC->APB1ENR, RCC_APB1ENR_USBEN);

                /* free USB memory */
                free(usb_mem);
                usb_mem = NULL;

                return STD_RET_OK;
        } else {
                errno = EBUSY;
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_OPEN(USBD, void *device_handle, u32_t flags)
{
        UNUSED_ARG(flags);

        USB_ep_t *hdl = device_handle;

        return _sys_device_lock(&hdl->dev_lock) ? STD_RET_OK : STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_CLOSE(USBD, void *device_handle, bool force)
{
        USB_ep_t *hdl = device_handle;

        if (_sys_device_is_access_granted(&hdl->dev_lock) || force) {
                _sys_device_unlock(&hdl->dev_lock, force);
                return STD_RET_OK;
        } else {
                errno = EBUSY;
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[in ]           fattr                  file attributes
 *
 * @return number of written bytes, -1 if error
 */
//==============================================================================
API_MOD_WRITE(USBD, void *device_handle, const u8_t *src, size_t count, fpos_t *fpos, struct vfs_fattr fattr)
{
        UNUSED_ARG(fpos);
        UNUSED_ARG(fattr);

        USB_ep_t *hdl = device_handle;

        ssize_t n = -1;

        if (_sys_device_is_access_granted(&hdl->dev_lock) && usb_mem->activated) {
                bool   IN_enabled = false;
                size_t ep_size    = 0;

                if (hdl->minor == USB_EP_NUM__ENDP0) {
                        IN_enabled = true;
                        ep_size    = _USBD_ENDPOINT0_SIZE;
                } else if (usb_mem->ep_config) {
                        IN_enabled = usb_mem->ep_config->ep[hdl->minor].IN_enabled;
                        ep_size    = get_ep_tx_buf_size(hdl->minor);
                }

                if (IN_enabled && ep_size) {

                        set_write_in_progress(hdl->minor, true);

                        n = 0;

                        if (hdl->minor == USB_EP_NUM__ENDP0) {
                                size_t len = 0;

                                while (count) {
                                        /* adjust endpoint size */
                                        len = (count > ep_size) ? ep_size : count;

                                        /* check if send or status stage are skipped by SETUP packet*/
                                        if (_sys_semaphore_wait(hdl->setup, 0) == true) {
                                                _sys_semaphore_signal(hdl->setup);
                                                goto write_end;
                                        }

                                        /* send data */
                                        low_level_pma_write(USB_PMA->EP[hdl->minor].SBF.ADDR_TX, src, len);
                                        USB_PMA->EP[hdl->minor].SBF.COUNT_TX = len;
                                        set_ep_tx_status(hdl->minor, USB_EP_STATUS__VALID);
                                        set_ep_rx_status(hdl->minor, USB_EP_STATUS__VALID);

                                        /* wait for data sent */
                                        if (_sys_semaphore_wait(hdl->tx, ep0_data_stage_transmit_timeout_ms) != true) {
                                                set_ep_tx_status(hdl->minor, USB_EP_STATUS__STALL);
                                                set_ep_rx_status(hdl->minor, USB_EP_STATUS__VALID);
                                                goto write_end;
                                        } else {
                                                if (hdl->write_in_progress == false) {
                                                        goto write_end;
                                                }
                                        }

                                        n     += len;
                                        src   += len;
                                        count -= len;

                                        /* check Status Stage */
                                        if (_sys_semaphore_wait(hdl->rx, ep0_status_stage_timeout_ms) == true) {
                                                goto write_end;
                                        } else {
                                                if (_sys_semaphore_wait(hdl->setup, 0) == true) {
                                                        _sys_semaphore_signal(hdl->setup);
                                                        goto write_end;
                                                }
                                        }
                                }

