devdnl/dnx-rtos/src/system/drivers/usbd/stm32f1/usbd.c
                                /* send Zero-Length Packet */
                                if (len == ep_size) {
                                        send_ZLP(hdl->minor);
                                }
                        } else {
                                while (count) {
                                        size_t len = (count > ep_size) ? ep_size : count;

                                        low_level_pma_write(USB_PMA->EP[hdl->minor].SBF.ADDR_TX, src, len);
                                        USB_PMA->EP[hdl->minor].SBF.COUNT_TX = len;
                                        set_ep_tx_status(hdl->minor, USB_EP_STATUS__VALID);

                                        if (_sys_semaphore_wait(hdl->tx, MAX_DELAY_MS) != true) {
                                                set_ep_tx_status(hdl->minor, USB_EP_STATUS__NAK);
                                                break;
                                        } else {
                                                if (hdl->write_in_progress == false) {
                                                        break;
                                                }
                                        }

                                        n     += len;
                                        src   += len;
                                        count -= len;
                                }
                        }

                        write_end:
                        set_write_in_progress(hdl->minor, false);

                } else {
                        errno = EPERM;
                }
        } else {
                errno = EACCES;
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[in ]           fattr                  file attributes
 *
 * @return number of read bytes, -1 if error
 */
//==============================================================================
API_MOD_READ(USBD, void *device_handle, u8_t *dst, size_t count, fpos_t *fpos, struct vfs_fattr fattr)
{
        UNUSED_ARG(fpos);
        UNUSED_ARG(fattr);

        USB_ep_t *hdl = device_handle;

        ssize_t n = -1;

        if (_sys_device_is_access_granted(&hdl->dev_lock) && usb_mem->activated) {
                bool   OUT_enabled = false;
                size_t ep_size     = 0;

                if (hdl->minor == USB_EP_NUM__ENDP0) {
                        OUT_enabled = true;
                        ep_size     = _USBD_ENDPOINT0_SIZE;
                } else if (usb_mem->ep_config) {
                        OUT_enabled = usb_mem->ep_config->ep[hdl->minor].OUT_enabled;
                        ep_size     = get_ep_rx_buf_size(hdl->minor);
                }

                if (OUT_enabled && ep_size) {

                        set_read_in_progress(hdl->minor, true);

                        n = 0;

                        if (hdl->minor == USB_EP_NUM__ENDP0) {
                                while (count) {
                                        /* wait for OUT token and set ZLP in case of status stage */
                                        USB_PMA->EP[hdl->minor].SBF.COUNT_TX = 0;
                                        set_ep_tx_status(hdl->minor, USB_EP_STATUS__VALID);
                                        set_ep_rx_status(hdl->minor, USB_EP_STATUS__VALID);

                                        if (_sys_semaphore_wait(hdl->rx, ep0_data_stage_receive_timeout_ms) != true) {
                                                break;
                                        } else {
                                                if (hdl->read_in_progress == false) {
                                                        break;
                                                }
                                        }

                                        /* copy data to user's buffer */
                                        size_t len = (count > ep_size) ? ep_size : count;

                                        if (len > get_ep_received_size(hdl->minor)) {
                                                len = get_ep_received_size(hdl->minor);
                                        }

                                        low_level_pma_read(USB_PMA->EP[hdl->minor].SBF.ADDR_RX, dst, len);

                                        dst   += len;
                                        count -= len;
                                        n     += len;

                                        /* check status stage */
                                        if (_sys_semaphore_wait(hdl->tx, ep0_status_stage_timeout_ms) == true) {
                                                break;
                                        }
                                }
                        } else {
                                while (count) {
                                        /* wait for OUT token */
                                        set_ep_rx_status(hdl->minor, USB_EP_STATUS__VALID);

                                        if (_sys_semaphore_wait(hdl->rx, MAX_DELAY_MS) != true) {
                                                break;
                                        } else {
                                                if (hdl->read_in_progress == false) {
                                                        break;
                                                }
                                        }

                                        /* copy data to user's buffer */
                                        size_t len = (count > ep_size) ? ep_size : count;

                                        if (len > get_ep_received_size(hdl->minor)) {
                                                len = get_ep_received_size(hdl->minor);
                                        }

                                        low_level_pma_read(USB_PMA->EP[hdl->minor].SBF.ADDR_RX, dst, len);

                                        dst   += len;
                                        count -= len;
                                        n     += len;

                                        if (len < ep_size) {
                                                break;
                                        }
                                }
                        }

                        set_read_in_progress(hdl->minor, false);

                } else {
                        errno = EPERM;
                }
        } else {
                errno = EACCES;
        }

        return n;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_IOCTL(USBD, void *device_handle, int request, void *arg)
{
        USB_ep_t *hdl = device_handle;

        switch (request) {
        case IOCTL_USBD__START:
                if (usb_mem->activated == false) {
                        /* reset USB peripherial */
                        SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);
                        CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);

                        /* enable USB transceiver */
                        CLEAR_BIT(USB->CNTR, USB_CNTR_PDWN | USB_CNTR_FRES);
                        _sys_sleep_ms(1);

                        /* clear USB IRQ flags */
                        USB->ISTR = 0;

                        /* enable specified USB interrupts */
                        SET_BIT(USB->CNTR, USB_CNTR_CTRM | USB_CNTR_RESETM | USB_CNTR_ERRM /*| USB_CNTR_SOFM*/);

                        usb_mem->activated = true;

                        enable_usb_visible_pullup();

                        while (usb_mem->reset != true) {
                                _sys_sleep_ms(5);
                        }

                        if (_sys_semaphore_wait(usb_mem->ep[USB_EP_NUM__ENDP0]->setup, 1000) == true) {
                                _sys_semaphore_signal(usb_mem->ep[USB_EP_NUM__ENDP0]->setup);
                        }

