devdnl/dnx-rtos/src/system/drivers/usbd/stm32f1/usbd.c
                        usb_mem->reset = false;

                        return STD_RET_OK;
                } else {
                        errno = ECANCELED;
                }
                break;

        case IOCTL_USBD__STOP:
                if (usb_mem->activated) {
                        usb_mem->activated = false;

                        disable_usb_visible_pullup();

                        /* reset USB peripherial */
                        SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);
                        CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);

                        /* clear semaphores */
                        for (usb_ep_num_t ep = USB_EP_NUM__ENDP0; ep < NUMBER_OF_ENDPOINTS; ep++) {
                                if (usb_mem->ep[ep]) {
                                        if (usb_mem->ep[ep]->rx) {
                                                _sys_semaphore_wait(usb_mem->ep[ep]->rx, 0);
                                        }

                                        if (usb_mem->ep[ep]->tx) {
                                                _sys_semaphore_wait(usb_mem->ep[ep]->tx, 0);
                                        }

                                        if (usb_mem->ep[ep]->setup) {
                                                _sys_semaphore_wait(usb_mem->ep[ep]->setup, 0);
                                        }

                                        usb_mem->ep[ep]->read_in_progress  = false;
                                        usb_mem->ep[ep]->setup_in_progress = false;
                                        usb_mem->ep[ep]->write_in_progress = false;
                                }
                        }

                        usb_mem->ep_config = NULL;

                        return STD_RET_OK;
                } else {
                        errno = ECANCELED;
                }
                break;

        case IOCTL_USBD__CONFIGURE_EP_1_7:
                if (arg) {
                        if (usb_mem->activated) {
                                usb_mem->ep_config = arg;
                                return configure_endpoints_1_7() ? STD_RET_OK : STD_RET_ERROR;
                        } else {
                                errno = EBUSY;
                        }
                } else {
                        errno = EINVAL;
                }
                break;

        case IOCTL_USBD__SET_ADDRESS:
                if (usb_mem->activated) {
                        USB->DADDR = USB_DADDR_EF | ((int)arg & USB_DADDR_ADD);
                        return STD_RET_OK;
                } else {
                        errno = ECANCELED;
                }
                break;

        case IOCTL_USBD__SEND_ZLP:
                if (usb_mem->activated) {
                        return send_ZLP(hdl->minor) ? STD_RET_OK : STD_RET_ERROR;
                } else {
                        errno = ECANCELED;
                }
                break;

        case IOCTL_USBD__SET_EP_STALL:
                if (usb_mem->activated) {
                        int ep = (int)arg;

                        if ((ep & 0x7) < NUMBER_OF_ENDPOINTS) {
                                if (ep & USB_ENDP_IN) {
                                        set_ep_tx_status(ep & 0x7, USB_EP_STATUS__STALL);
                                } else {
                                        set_ep_rx_status(ep & 0x7, USB_EP_STATUS__STALL);
                                }

                                return STD_RET_OK;
                        } else {
                                errno = EINVAL;
                        }
                } else {
                        errno = ECANCELED;
                }
                break;

        case IOCTL_USBD__SET_EP_VALID:
                if (usb_mem->activated) {
                        int ep = (int)arg;

                        if ((ep & 0x7) < NUMBER_OF_ENDPOINTS) {
                                if (ep & USB_ENDP_IN) {
                                        set_ep_tx_status(ep & 0x7, USB_EP_STATUS__VALID);
                                } else {
                                        set_ep_rx_status(ep & 0x7, USB_EP_STATUS__VALID);
                                }

                                return STD_RET_OK;
                        } else {
                                errno = EINVAL;
                        }
                } else {
                        errno = ECANCELED;
                }
                break;

        case IOCTL_USBD__WAS_RESET:
                if (usb_mem->activated) {
                        _sys_critical_section_begin();
                        bool reset     = usb_mem->reset;
                        usb_mem->reset = false;
                        _sys_critical_section_end();
                        return reset;
                } else {
                        errno = ECANCELED;
                }
                break;

        case IOCTL_USBD__SET_ERROR_STATUS:
                if (usb_mem->activated) {
                        set_ep_rx_status(hdl->minor, USB_EP_STATUS__STALL);
                        set_ep_tx_status(hdl->minor, USB_EP_STATUS__STALL);
                        return STD_RET_OK;
                } else {
                        errno = ECANCELED;
                }
                break;

        case IOCTL_USBD__GET_SETUP_PACKET:
                if (usb_mem->activated && hdl->minor == USB_EP_NUM__ENDP0) {
                        if (!arg) {
                                break;
                        }

                        set_setup_in_progress(hdl->minor, true);

                        usbd_setup_container_t *setup = arg;
                        if (_sys_semaphore_wait(hdl->setup, setup->timeout) == true) {

                                if (hdl->setup_in_progress == true) {
                                        set_setup_in_progress(hdl->minor, false);

                                        low_level_pma_read(USB_PMA->EP[hdl->minor].SBF.ADDR_RX,
                                                           (u8_t*)&setup->packet,
                                                           sizeof(usb_setup_packet_t));

