devdnl/dnx-rtos/src/system/drivers/usbd/stm32f1/usbd.c
                USB_PMA->EP[USB_EP_NUM__ENDP0].SBF.ADDR_TX  = (BTABLE_SIZE) << 1;
                USB_PMA->EP[USB_EP_NUM__ENDP0].SBF.ADDR_RX  = (BTABLE_SIZE + _USBD_ENDPOINT0_SIZE) << 1;
                USB_PMA->EP[USB_EP_NUM__ENDP0].SBF.COUNT_TX = 0;
                USB_PMA->EP[USB_EP_NUM__ENDP0].SBF.COUNT_RX = endpoint_size_to_register(_USBD_ENDPOINT0_SIZE);
                USB->EPxR[USB_EP_NUM__ENDP0] = USB->EPxR[USB_EP_NUM__ENDP0] | USB_EP0R_CTR_RX | USB_EP0R_CTR_TX;
                USB->EPxR[USB_EP_NUM__ENDP0] = USB_EP0R_CTR_RX | USB_EP0R_CTR_TX
                                             | ep_rx_status_reg[USB_EP_STATUS__STALL]
                                             | ep_tx_status_reg[USB_EP_STATUS__STALL]
                                             | transfer_type_reg[USB_TRANSFER__CONTROL];
        } else {
                disable_endpoint(USB_EP_NUM__ENDP0);
        }

        /* disable all other endpoints */
        for (usb_ep_num_t ep = USB_EP_NUM__ENDP1; ep < NUMBER_OF_ENDPOINTS; ep++) {
                disable_endpoint(ep);
        }
}

//==============================================================================
/**
 * @brief Configure endpoints 1 to 7 to configured values. The Endpoint 0 is not
 *        reconfigured.
 *
 * @return Returns true on success, otherwise false.
 */
//==============================================================================
static bool configure_endpoints_1_7()
{
        bool status          = true;
        u8_t buf_start_index = BTABLE_SIZE + (2 * _USBD_ENDPOINT0_SIZE);

        _sys_critical_section_begin();

        for (usb_ep_num_t ep = USB_EP_NUM__ENDP1; ep < NUMBER_OF_ENDPOINTS; ep++) {
                if (usb_mem->ep[ep]) {
                        const struct usbd_ep_config *epcfg = &usb_mem->ep_config->ep[ep];

                        /* convert buffer size to register value */
                        u16_t tx_buf_size = endpoint_size_to_register(epcfg->IN_buffer_size);
                        u16_t rx_buf_size = endpoint_size_to_register(epcfg->OUT_buffer_size);

                        if (tx_buf_size == UINT16_MAX || rx_buf_size == UINT16_MAX) {
                                status = false;
                                break;
                        }

                        /* configure BTABLE */
                        USB_PMA->EP[ep].SBF.ADDR_TX  = buf_start_index << 1;
                        USB_PMA->EP[ep].SBF.COUNT_TX = 0;
                        USB_PMA->EP[ep].SBF.ADDR_RX  = ((buf_start_index + epcfg->IN_buffer_size) << 1);
                        USB_PMA->EP[ep].SBF.COUNT_RX = tx_buf_size;

                        buf_start_index += (epcfg->IN_buffer_size + epcfg->OUT_buffer_size);

                        /* set Endpoint OUT status according to configuration */
                        u16_t rx_status;
                        if (epcfg->OUT_buffer_size > 0 && epcfg->OUT_enabled == true) {
                                rx_status = ep_rx_status_reg[USB_EP_STATUS__VALID];
                        } else {
                                rx_status = ep_rx_status_reg[USB_EP_STATUS__DISABLED];
                        }

                        /* set Endpoint IN status according to configuration */
                        u16_t tx_status;
                        if (epcfg->IN_buffer_size > 0 && epcfg->IN_enabled == true) {
                                if (epcfg->transfer_type == USB_TRANSFER__ISOCHRONOUS) {
                                        tx_status = ep_tx_status_reg[USB_EP_STATUS__VALID];
                                } else {
                                        tx_status = ep_tx_status_reg[USB_EP_STATUS__NAK];
                                }
                        } else {
                                tx_status = ep_tx_status_reg[USB_EP_STATUS__DISABLED];
                        }

                        /* configure Endpoint */
                        USB->EPxR[ep] = USB->EPxR[ep] | USB_EP0R_CTR_RX | USB_EP0R_CTR_TX;
                        USB->EPxR[ep] = USB_EP0R_CTR_RX
                                      | USB_EP0R_CTR_TX
                                      | transfer_type_reg[epcfg->transfer_type]
                                      | rx_status
                                      | tx_status
                                      | ep;
                } else {
                        disable_endpoint(ep);
                }
        }

        _sys_critical_section_end();

        return status;
}

//==============================================================================
/**
 * @brief Clears the CTR RX flag in the selected endpoint
 *
 * @param ep            selected endpoint
 */
//==============================================================================
static void clear_EPR_CTR_RX(usb_ep_num_t ep)
{
        USB->EPxR[ep] = (USB->EPxR[ep] & (USB_EPR_EP_TYPE | USB_EPR_EP_KIND | USB_EPR_EA)) | USB_EPR_CTR_TX;
}

//==============================================================================
/**
 * @brief Clears the CTR TX flag in the selected endpoint
 *
 * @param ep            selected endpoint
 */
//==============================================================================
static void clear_EPR_CTR_TX(usb_ep_num_t ep)
{
        USB->EPxR[ep] = (USB->EPxR[ep] & (USB_EPR_EP_TYPE | USB_EPR_EP_KIND | USB_EPR_EA)) | USB_EPR_CTR_RX;
}

//==============================================================================
/**
 * @brief Function perform a low level write operation to the PMA
 *
 * @param pma_offset    PMA register offset
 * @param buffer        data source
 * @param count         number of bytes to write
 */
//==============================================================================
static void low_level_pma_write(u32_t pma_offset, const u8_t *buffer, size_t count)
{
        u32_t *pma = &USB_PMA->BUFFER[(pma_offset / 2) - BTABLE_SIZE];

        while (count >= 2) {
                u8_t b0  = *(buffer++);
                u8_t b1  = *(buffer++);
                *(pma++) = (b1 << 8) | b0;
                count   -= 2;
        }

        if (count == 1) {
                *(pma++) = *(buffer++);
        }
}

//==============================================================================
/**
 * @brief Function perform a low level read operation from the PMA
 *
 * @param pma_offset    PMA register offset
 * @param buffer        data destination
 * @param count         number of bytes to read
 */
//==============================================================================
static void low_level_pma_read(u32_t pma_offset, u8_t *buffer, size_t count)
{
        u32_t  *pma = &USB_PMA->BUFFER[(pma_offset / 2) - BTABLE_SIZE];

        while (count >= 2) {
                u16_t data  = *(pma++);
                *(buffer++) = data & 0xFF;
                *(buffer++) = data >> 8;
                count      -= 2;
        }

        if (count == 1) {
                *(buffer++) = *(pma++) & 0xFF;
        }
}

//==============================================================================
/**
 * @brief Function send Zero Length Packet from selected endpoint
 *
 * @param ep            endpoint number
 *
 * @return On success true is returned, otherwise false.
 */
//==============================================================================
static bool send_ZLP(usb_ep_num_t ep)
{
        bool result = false;

        if (ep == USB_EP_NUM__ENDP0) {
                if (_sys_semaphore_wait(usb_mem->ep[ep]->setup, 0) == true) {
                        _sys_semaphore_signal(usb_mem->ep[ep]->setup);

                } else {
                        USB_PMA->EP[ep].SBF.COUNT_TX = 0;
                        set_ep_rx_status(ep, USB_EP_STATUS__VALID);
                        set_ep_tx_status(ep, USB_EP_STATUS__VALID);

                        result = _sys_semaphore_wait(usb_mem->ep[ep]->tx, ep0_data_stage_transmit_timeout_ms);
                        if (result == true) {

                                /* check Status Stage (if exist) */
                                if (_sys_semaphore_wait(usb_mem->ep[ep]->rx, ep0_status_stage_timeout_ms) == false) {
                                        if (_sys_semaphore_wait(usb_mem->ep[ep]->setup, ep0_status_stage_timeout_ms) == true) {
                                                _sys_semaphore_signal(usb_mem->ep[ep]->setup);
                                        }
                                }
                        } else {
                                set_ep_tx_status(ep, USB_EP_STATUS__STALL);
                        }
                }

        } else {
                USB_PMA->EP[ep].SBF.COUNT_TX = 0;
                set_ep_tx_status(ep, USB_EP_STATUS__VALID);
                result = _sys_semaphore_wait(usb_mem->ep[ep]->tx, ep1_7_data_stage_transmit_timeout_ms);
        }

        return result;
}

//==============================================================================
/**
 * @brief Function returns a size of Tx (IN) buffer of selected endpoint
 *
 * @param ep            endpoint number
 *
 * @return A size of Tx (IN) endpoint.
 */
//==============================================================================
static size_t get_ep_tx_buf_size(usb_ep_num_t ep)
{
        return usb_mem->ep_config->ep[ep].IN_buffer_size;
}

//==============================================================================
/**
 * @brief Function returns a size of Rx (OUT) buffer of selected endpoint
 *
 * @param ep            endpoint number
 *
 * @return A size of Rx (OUT) endpoint.
 */
//==============================================================================
static size_t get_ep_rx_buf_size(usb_ep_num_t ep)
{
        return usb_mem->ep_config->ep[ep].OUT_buffer_size;
}

//==============================================================================
/**
 * @brief Function returns a number of received bytes by selected endpoint
 *
 * @param ep            endpoint number
 *
 * @return A number of received bytes.
 */
//==============================================================================
static size_t get_ep_received_size(usb_ep_num_t ep)
{
        return USB_PMA->EP[ep].SBF.COUNT_RX & USB_COUNT0_RX_0_COUNT0_RX_0;
}

//==============================================================================
/**
 * @brief Function set "setup in progress" flag in the critical section
 */
//==============================================================================
static void set_setup_in_progress(usb_ep_num_t ep, bool state)
{
        _sys_critical_section_begin();
        usb_mem->ep[ep]->setup_in_progress = state;
        _sys_critical_section_end();
}

//==============================================================================
/**
 * @brief Function set "write in progress" flag in the critical section
 */
//==============================================================================
static void set_write_in_progress(usb_ep_num_t ep, bool state)
{
        _sys_critical_section_begin();
        usb_mem->ep[ep]->write_in_progress = state;
        _sys_critical_section_end();
}

//==============================================================================
/**
 * @brief Function set "read in progress" flag in the critical section
 */
//==============================================================================
static void set_read_in_progress(usb_ep_num_t ep, bool state)
{
        _sys_critical_section_begin();
        usb_mem->ep[ep]->read_in_progress = state;
        _sys_critical_section_end();
}

//==============================================================================
/**
 * @brief High priority USB IRQ (isochronous transfers)
 */
//==============================================================================
void USB_HP_CAN1_TX_IRQHandler(void)
{
        /* Interrupt not used (can be (or must?) be used in the Isochronous transfer) */
}

//==============================================================================
/**
 * @brief Low priority USB IRQ
 */
//==============================================================================
void USB_LP_CAN1_RX0_IRQHandler(void)
{
        bool  rx_woken    = false;
        bool  tx_woken    = false;
        bool  setup_woken = false;
        u16_t flags       = USB->CNTR & USB->ISTR;

        if (flags & USB_ISTR_CTR) {
                u8_t  ep_id    = USB->ISTR & USB_ISTR_EP_ID;
                u32_t ep_flags = USB->EPxR[ep_id];

                if (ep_flags & USB_EPR_SETUP) {

