devdnl/dnx-rtos/src/system/drivers/usbd/stm32f1/usbd.c
                        clear_EPR_CTR_RX(ep_id);
                        if (ep_id == USB_EP_NUM__ENDP0) {
                                _sys_semaphore_signal_from_ISR(usb_mem->ep[ep_id]->setup, &setup_woken);
                        }

                } else if (ep_flags & USB_EPR_CTR_RX) {

                        clear_EPR_CTR_RX(ep_id);
                        _sys_semaphore_signal_from_ISR(usb_mem->ep[ep_id]->rx, &rx_woken);
                        rx_woken = true;

                } else if (ep_flags & USB_EPR_CTR_TX) {

                        clear_EPR_CTR_TX(ep_id);
                        _sys_semaphore_signal_from_ISR(usb_mem->ep[ep_id]->tx, &tx_woken);
                        tx_woken = true;
                }
        }

        if (flags & USB_ISTR_PMAOVR) {
                USB->ISTR = ~USB_ISTR_PMAOVR;
        }

        if (flags & USB_ISTR_ERR) {
                USB->ISTR = ~USB_ISTR_ERR;
                usb_mem->error_cnt++;
        }

        if (flags & USB_ISTR_WKUP) {
                USB->ISTR = ~USB_ISTR_WKUP;
        }

        if (flags & USB_ISTR_SUSP) {
                USB->ISTR = ~USB_ISTR_SUSP;
        }

        if (flags & USB_ISTR_RESET) {
                USB->ISTR   = ~USB_ISTR_RESET;
                USB->BTABLE = BTABLE_ADDRESS;
                USB->DADDR  = USB_DADDR_EF | 0;
                configure_endpoint_0();

                usb_mem->reset = true;

                for (int i = 0; i < NUMBER_OF_ENDPOINTS; i++) {
                        if (usb_mem->ep[i]) {
                                if (usb_mem->ep[i]->write_in_progress) {
                                        usb_mem->ep[i]->write_in_progress = false;
                                        _sys_semaphore_signal_from_ISR(usb_mem->ep[i]->tx, &tx_woken);
                                } else {
                                        _sys_semaphore_wait_from_ISR(usb_mem->ep[i]->tx, &tx_woken);
                                }

                                if (usb_mem->ep[i]->read_in_progress) {
                                        usb_mem->ep[i]->read_in_progress = false;
                                        _sys_semaphore_signal_from_ISR(usb_mem->ep[i]->rx, &rx_woken);
                                } else {
                                        _sys_semaphore_wait_from_ISR(usb_mem->ep[i]->rx, &rx_woken);
                                }

                                if (usb_mem->ep[i]->setup) {
                                        if (usb_mem->ep[i]->setup_in_progress) {
                                                usb_mem->ep[i]->setup_in_progress = false;
                                                _sys_semaphore_signal_from_ISR(usb_mem->ep[i]->setup, &setup_woken);
                                        } else {
                                                _sys_semaphore_wait_from_ISR(usb_mem->ep[i]->setup, &setup_woken);
                                        }
                                }
                        }
                }
        }

        if (flags & USB_ISTR_SOF) {
                USB->ISTR = ~USB_ISTR_SOF;
        }

        if (flags & USB_ISTR_ESOF) {
                USB->ISTR = ~USB_ISTR_ESOF;
        }

        if (rx_woken || tx_woken || setup_woken) {
                _sys_task_yield_from_ISR();
        }
}

/*==============================================================================
  End of file
==============================================================================*/
